{
  "project": "mobility-app",
  "branchName": "ralph/goal-tracking",
  "prdFileName": "prd-goals.json",
  "description": "Goal tracking system for defining and monitoring specific progress targets. Users can set measurable goals (reduce pain, improve symmetry, workout consistency) and track progress toward them with visual indicators and milestone celebrations.",
  "context": {
    "purpose": "Nick needs concrete goals to stay motivated. Instead of vague 'fix my posture', he can set specific targets like 'reduce pain from 6 to 3' or 'achieve 85% symmetry score'.",
    "existingData": "App tracks: pain levels (1-10), posture scores (0-100), symmetry scores (0-100), workout consistency (% of sessions completed), workout streaks",
    "keyInsight": "Goals should be SMART - Specific, Measurable, Achievable, Relevant, Time-bound. Each goal type has different tracking logic."
  },
  "userStories": [
    {
      "id": "GL-001",
      "title": "Goal data model and storage",
      "description": "Create the data structures for storing and managing user goals.",
      "acceptanceCriteria": [
        "Create lib/goals.ts with types: Goal, GoalType, GoalStatus, GoalProgress",
        "GoalType enum: 'pain_reduction' | 'symmetry_improvement' | 'posture_score' | 'workout_consistency' | 'workout_streak' | 'custom'",
        "GoalStatus enum: 'active' | 'completed' | 'failed' | 'paused'",
        "Goal interface: { id, type, title, description, target_value, starting_value, current_value, deadline, created_at, completed_at, status }",
        "GoalProgress interface: { goal_id, recorded_at, value, notes }",
        "Create Supabase migration: goals table and goal_progress table",
        "Add CRUD functions: createGoal, updateGoal, deleteGoal, getGoals, getGoalProgress",
        "Add progress calculation: computeGoalProgress(goal) returns { percentComplete, onTrack, projectedCompletion, trend }",
        "Add tests for progress calculation logic",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "The progress calculation is the tricky part. For pain reduction, lower is better. For symmetry/posture, higher is better. Consistency is percentage-based."
    },
    {
      "id": "GL-002",
      "title": "Goal creation wizard",
      "description": "Guided flow for creating new goals with appropriate defaults and validation.",
      "acceptanceCriteria": [
        "Add app/goals/new.tsx with multi-step goal creation wizard",
        "Step 1: Select goal type (pain reduction, symmetry, posture, consistency, streak, custom)",
        "Each type shows description and example: 'Pain Reduction: Track your pain level decreasing over time'",
        "Step 2: Set target values - smart defaults based on current data (e.g., if current pain is 6, suggest target of 3)",
        "For consistency goals: target is percentage (e.g., 80% of sessions completed)",
        "For streak goals: target is number of days (e.g., 30-day streak)",
        "Step 3: Set deadline - date picker with suggested timeframes (4 weeks, 8 weeks, 12 weeks)",
        "Step 4: Review and confirm - shows projected milestones",
        "Validation: target must be achievable (can't set pain target higher than current), deadline must be in future",
        "Save to Supabase on confirmation",
        "Navigate to goals list after creation",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Keep the wizard simple - 4 screens max. The smart defaults should make it easy to create good goals quickly."
    },
    {
      "id": "GL-003",
      "title": "Goals dashboard and list view",
      "description": "Main screen showing all active goals with progress indicators.",
      "acceptanceCriteria": [
        "Add app/(tabs)/goals.tsx - new tab in navigation",
        "Show list of active goals as cards",
        "Each goal card displays: title, type badge, progress bar (percentage to target), current value vs target, days remaining",
        "Progress bar color: green (on track), yellow (slightly behind), red (significantly behind)",
        "On-track calculation: compare expected progress at this date vs actual progress",
        "Empty state with CTA to create first goal",
        "Floating action button to add new goal",
        "Pull to refresh",
        "Tap goal card to view detail screen",
        "Section for completed/failed goals (collapsible)",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "This should feel motivating, not overwhelming. Progress bars and color coding give quick visual feedback."
    },
    {
      "id": "GL-004",
      "title": "Goal detail screen with history",
      "description": "Detailed view of a single goal showing progress history and projections.",
      "acceptanceCriteria": [
        "Add app/goals/[id].tsx - goal detail screen",
        "Header: goal title, type badge, status badge",
        "Large progress ring/circle showing percentage complete",
        "Stats row: starting value, current value, target value, days remaining",
        "Progress chart: line graph showing value over time with target line",
        "Milestones section: show when 25%, 50%, 75% was reached (or projected to be reached)",
        "Projection: 'At current rate, you'll reach your goal by [date]'",
        "Actions: Edit goal, Pause goal, Delete goal, Mark as completed (if close enough)",
        "History list: recent progress entries with dates and values",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "The projection feature is key for motivation - showing that effort is paying off."
    },
    {
      "id": "GL-005",
      "title": "Automatic progress tracking",
      "description": "Automatically update goal progress when relevant metrics are logged.",
      "acceptanceCriteria": [
        "Create lib/goalTracker.ts with automatic progress update logic",
        "When a metric entry is saved (pain_level, posture_score, symmetry_score), check for active goals of that type",
        "Auto-create goal_progress entry with the new value",
        "Update goal.current_value to latest value",
        "For workout_consistency goals: calculate from workout history (sessions this week / scheduled sessions)",
        "For workout_streak goals: use streak calculation from workoutAnalytics.ts",
        "Check if goal is now complete (target reached) and update status",
        "Trigger celebration notification when goal is completed",
        "Add hook useGoalTracker() that components can use to trigger updates",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "This is the magic - progress should update automatically without user doing anything extra. Just log your metrics and goals update."
    },
    {
      "id": "GL-006",
      "title": "Goal celebrations and notifications",
      "description": "Celebrate milestone achievements and goal completions.",
      "acceptanceCriteria": [
        "When goal reaches 25%, 50%, 75% milestones: show toast notification with confetti emoji",
        "When goal is completed: show full-screen celebration modal with animation",
        "Celebration modal: trophy icon, congratulations message, stats summary (started at X, now at Y, took Z days)",
        "Share button on celebration modal to share achievement",
        "Badge system: award badges for completing goals (First Goal, Pain Crusher, Consistency King, etc.)",
        "Store earned badges in Supabase (badges table)",
        "Display badges on profile screen or goals dashboard",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": false,
      "notes": "The dopamine hit from celebrations keeps users motivated. Don't overdo it - save the big celebration for actual goal completion."
    },
    {
      "id": "GL-007",
      "title": "Goal suggestions based on data",
      "description": "AI-powered goal suggestions based on user's current metrics and history.",
      "acceptanceCriteria": [
        "Add suggestGoals(metrics, history): Goal[] function in lib/goals.ts",
        "Analyze current pain level - if above 5, suggest pain reduction goal",
        "Analyze symmetry score - if below 80, suggest symmetry improvement goal",
        "Analyze workout consistency - if below 70%, suggest consistency goal",
        "Analyze streaks - if current streak is 0-3, suggest streak goal (7 days)",
        "Set realistic targets based on historical improvement rate",
        "Show suggested goals on goals dashboard with 'Suggested for you' section",
        "One-tap to create suggested goal (pre-filled wizard)",
        "Don't suggest goals user already has active",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": false,
      "notes": "Keep suggestions smart but not pushy. Max 2-3 suggestions at a time."
    }
  ]
}